{"Preguntas": [
    {   "Texto": "Cuál de los siguientes grupos de matrices tienen complejidad igual a n^2", 
        "RespuestasPosibles": [{"0": "Cuadradas"}, {"1": "Permutación de diagonales"}, {"2": "Las que tienen una fila 0"}, {"3": "Las de dimensión 2x4"}], 
        "RespuestaCorrecta": "Permutación de diagonales", 
        "Explicacion": "Al ser la matriz de orden n, la diagonal va a tener n elementos, por tanto, todas las permutaciones son n^2",
        "Tiempo": 20},
    {   "Texto": "Una matriz A simétrica y definida positiva siempre se puede descomponer de la forma A = LL^t donde L es una matriz ...", 
        "RespuestasPosibles": [{"0": "cuadrada"}, {"1": "triangular inferior"}, {"2": "de valores pares"}, {"3": "nula"}],
"RespuestaCorrecta": "triangular inferior",
	"Explicacion": "", 
        "Tiempo": 25},
    {   "Texto": "Diga V o F \n Existen características especiales que debe cumplir una matriz para poderle aplicar la factorización PLU",
        "RespuestasPosibles": [{"0": "Falso"}, {"1": "Verdadero"}],
        "RespuestaCorrecta": "Verdadero",
	"Explicacion": "Para poderle aplicar la factorización PLU a una matriz esta debe cumplir que sea cuadrada y no singular",
        "Tiempo": 10},
    {   "Texto": "Para poderle aplicar a una matriz la descomposición de Choleski es necesario que esta sea simétrica y definida positiva?",
        "RespuestasPosibles": [{"0": "Si"}, {"1": "No"}, {"2": "😶"}],
        "RespuestaCorrecta": "Si",
	"Explicacion": "Resulta necesario que la matriz sea simétrica y definida positivo porque en el algoritmo para calcular algunos elementos de la matriz L aparece una raíz, y dentro de esa raíz está el determinante de un menor principal.", 
        "Tiempo": 20},
    {   "Texto": "Para determinar si una matriz simetrica es definida positiva de manera eficiente, podemos utilizar....",
        "RespuestasPosibles": [{"0": "Descomposición de Choleski"}, {"1": "Factorización PLU"}, {"2": "Normas matriciales"}, {"3": "Estrategia de pivoteo"}],
        "RespuestaCorrecta": "Descomposición de Choleski",
	"Explicacion": " La forma eficiente de determinar si una matriz simétrica es definida positiva es aplicarle el método de Cholesky. Si el método termina, la matriz es definida positiva.",
        "Tiempo": 35},
    {   "Texto": "Dada A una matriz cuadrada no singular, es posible obtener su factorización PLU usando únicamente la memoria que ocupa la matriz A y un vector de enteros de tamaño n ?",
        "RespuestasPosibles": [{"0": "Si"}, {"1": "No"}, {"2": "No se"}],
        "RespuestaCorrecta": "Si",
	"Explicacion": "Cuando se calcula la factorización PLU de una matriz se obtiene una matriz triangular inferior que encima de la diagonal solo tiene 0, y una matriz triangular superior que debajo de la diagonal solo tiene ceros, por tanto podemos guardar los elementos distintos de 0 de las dos matrices en un sola. Y la información que está en la matriz de permutaciones se puede tener en un vector", 
        "Tiempo": 40},
    {   "Texto": "Que estrategia de pivoteo en cada paso p elige la mayor entrada (en el sentido absoluto) de la p - ésima columna empezando con (p,p) hasta (m,p)?",
        "RespuestasPosibles": [{"0": "Pivoteo parcial escalado"}, {"1": "Pivoteo completo"}, {"2": "Pivoteo parcial"}],
        "RespuestaCorrecta": "Pivoteo parcial",
	"Explicacion": "🤷🏻‍♀️", 
        "Tiempo": 15},
    {   "Texto": "Que estrategia de pivoteo en el k - ésimo paso se busca el máximo entre los números |A_{i,j}| con p <= i <= m y p <= j <= m ?",
        "RespuestasPosibles": [{"0": "Pivoteo parcial escalado"}, {"1": "Pivoteo completo"}, {"2": "Pivoteo parcial"}],
        "RespuestaCorrecta": "Pivoteo completo",
	"Explicacion": "🤷🏻‍♀️",
        "Tiempo": 15},
    {   "Texto": "En la factorización PLU, la matriz triangular superior con elementos diagonales no nulos es: ",
        "RespuestasPosibles": [{"0": "P"}, {"1": "L"}, {"2": "U"}],
        "RespuestaCorrecta": "U",
	"Explicacion": "Además se sugiere tomar la matriz U como la misma matriz de la triangulación de Gauss",
        "Tiempo": 15},
    {   "Texto": "En la factorización PLU, matriz triangular inferior con elementos diagonales iguales a 1 es: ",
        "RespuestasPosibles": [{"0": "P"}, {"1": "L"}, {"2": "U"}],
        "RespuestaCorrecta": "L",
	"Explicacion": "Además se sugiere construir la matriz L con 1 en la diagonal y en la posición (i,j) el multiplicador usado para obtener un cero en la posición (i,j) de la matriz A ", 
        "Tiempo": 15},
    {	"Texto": "En criterio de convergencia del método de Jacobi,  que el elemento ubicado en la diagonal principal de cada ecuación sea mayor en valor absoluto que el resto de los elementos de la misma ecuación es: ", 
        "RespuestasPosibles": [{"0": "condición necesaria"}, {"1": "condición suficiente"}], 
        "RespuestaCorrecta": "condición necesaria", 
        "Explicacion": " La condición suficiente es que el elemento ubicado en la diagonal principal de cada ecuación sea mayor en valor absoluto que la suma del resto de los elementos de la misma ecuación. ",
        "Tiempo": 15}, 
    {	"Texto": "En criterio de convergencia del método de Jacobi, que el elemento ubicado en la diagonal principal de cada ecuación sea mayor en valor absoluto que la suma del resto de los elementos de la misma ecuación es: ", 
        "RespuestasPosibles": [{"0": "condición necesaria"}, {"1": "condición suficiente"}], 
        "RespuestaCorrecta": "condición suficiente", 
        "Explicacion": "La condición necesaria es que el elemento ubicado en la diagonal principal de cada ecuación sea mayor en valor absoluto que el resto de los elementos de la misma ecuación ",
        "Tiempo": 15},
    {	"Texto": "Si la norma infinita de la matriz de iteración del método de Jacobi es menor que 1 entonces: ", 
        "RespuestasPosibles": [{"0": "..."}, {"1": "el método de Gaus-Seidel converge"}, {"2": "el método de Gaus-Seidel no converge"}], 
        "RespuestaCorrecta": "el método de Gaus-Seidel converge", 
        "Explicacion": "Además el método de Gauss - Seidel converge más rapido que el de jacobi y si la norma 1 es menor que uno, los dos convergen pero no se puede asegurar cual lo hace más rápido.",
        "Tiempo": 25},
    {	"Texto": "Frobenius es un tipo de :", 
        "RespuestasPosibles": [{"0": "norma"}, {"1": "matriz"}, {"2": "polinomio"}], 
        "RespuestaCorrecta": "norma", 
        "Explicacion": "Esta entre los ejemplos de normas que vemos en clases",
        "Tiempo": 10}]}





































